## Tarea 1.

Importando datos

In [10]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt


titanic_data = pd.read_csv('titanic-data.csv')

#descripciones estadisticas del data frame
titanic_data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [5]:
titanic_data["Sex"].value_counts()

male      577
female    314
Name: Sex, dtype: int64

## Preguntas


#### .cantidad de personas de clase 1 que no sobrevivieron

In [6]:
len(titanic_data.loc[(titanic_data["Pclass"]==1) & (titanic_data["Survived"]==0)])

80

### . ¿ En qué propiedades encontraste valores perdidos?

In [26]:
#Mostrando las que tienen almenos un valor NaN
titanic_data.isna().any()

#Colocando en una lista solo las que tienen valores NaN
col_val_nan=titanic_data.columns[titanic_data.isna().any()].tolist()
col_val_nan

['Age', 'Cabin', 'Embarked']

### ¿podrías deshacerte de ellos?

In [30]:
#Si queremos eliminar las columnas con valores NaN 

#del titanic_data[col_val_nan]
titanic_data.drop(col_val_nan,axis=1).head()

,PassengerId,Survived,Pclass,Name,Sex,SibSp,Parch,Ticket,Fare
0,1,0,3,"Braund, Mr. Owen Harris",male,1,0,A/5 21171,7.2500
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,1,0,PC 17599,71.2833
2,3,1,3,"Heikkinen, Miss. Laina",female,0,0,STON/O2. 3101282,7.9250
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,1,0,113803,53.1000
4,5,0,3,"Allen, Mr. William Henry",male,0,0,373450,8.0500

In [32]:
#si queremos eliminar las filas donde se encuentran los valores NaN
titanic_data.dropna().head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S

### ¿al menos un infante de Queenstown sobrevivió?

In [49]:
#Tomando la de edad de un infante entre 1 a 6 años
infantes_s=len(titanic_data.loc[(titanic_data["Survived"]==1) & (titanic_data["Embarked"]=='Q') &(titanic_data["Age"]<=6)
                 &(titanic_data["Age"]>=1)])  

if infantes_s == 0:
    print ("No existe sobrevivientes infantes")
else :
    print ("cantidad de sobrevivientes")
    infantes_s

No existe sobrevivientes infantes

In [44]:
#titanic_data.loc[titanic_data["Age"]<=6]

In [52]:
infantes_s=len(titanic_data.loc[(titanic_data["Survived"]==1) & (titanic_data["Embarked"]!='Q') &(titanic_data["Age"]<=6)
                 &(titanic_data["Age"]>=1)])  

if infantes_s == 0:
    print ("No existe sobrevivientes infantes")
else :
    print ("cantidad de sobrevivientes")
    print (infantes_s)

cantidad de sobrevivientes
26

### ¿Cuántas mujeres mayores de 20 años sobrevivieron?

In [56]:
len(titanic_data.loc[(titanic_data["Survived"]==1) & (titanic_data["Sex"]!='female') &(titanic_data["Age"]>20)])

64